In [4]:
import pandas as pd

dict={
    'Name':['Alice','Bob'],'Age':[25,30]
}
print(dict)
print(type(dict))

{'Name': ['Alice', 'Bob'], 'Age': [25, 30]}
<class 'dict'>

In [7]:
df=pd.DataFrame(dict)
print(df)

    Name  Age
0  Alice   25
1    Bob   30

In [9]:
df=pd.DataFrame([[1,2],[3,4]],columns=['x','y'])
print(df)

   x  y
0  1  2
1  3  4

In [10]:
import numpy as np

In [11]:
df1=np.array(df)
print(df1)

[[1 2]
 [3 4]]

In [16]:
df.iloc[1,1]

0    1
1    3
Name: x, dtype: int64

In [17]:
df['y']

0    2
1    4
Name: y, dtype: int64

In [19]:
df.isnull().sum() ## sum of null values

x    2
y    2
dtype: int64

In [20]:
df['x'].value_counts()

x
1    1
3    1
Name: count, dtype: int64

In [25]:
dict={
     "name" : ['sharad','mahesh','rahul'],
     "marks": [12,21,45],
     "city" : ['pune','Mumbai','delhi']

}

## change the name to student_name
dict['student_name']=dict.pop('name')
print(dict)

{'marks': [12, 21, 45], 'city': ['pune', 'Mumbai', 'delhi'], 'student_name': ['sharad', 'mahesh', 'rahul']}

In [26]:
df=pd.DataFrame(dict)
df

   marks    city student_name
0     12    pune       sharad
1     21  Mumbai       mahesh
2     45   delhi        rahul

In [34]:
## Extract mahesh marks
df.iloc[1,[2,0]]

student_name    mahesh
marks               21
Name: 1, dtype: object

In [42]:
##other work around to get the mahesh marks
mahesh_marks=df.loc[df['student_name']=='mahesh','marks'].values[0]
mahesh_marks

  student_name  marks
1       mahesh     21

In [48]:
df[df['student_name'] == 'mahesh'][['student_name', 'marks']]
df[df['student_name']=='mahesh'][['student_name', 'marks']]

  student_name  marks
1       mahesh     21

In [49]:
# Define function to add 5 bonus marks
def add_bonus(x):
    return x + 5

# Apply function to 'marks' column
df['updated_marks'] = df['marks'].apply(add_bonus)

print(df)

   marks    city student_name  updated_marks
0     12    pune       sharad             17
1     21  Mumbai       mahesh             26
2     45   delhi        rahul             50

In [52]:
df.select_dtypes(include='number').aggregate(['sum','min'])

     marks  updated_marks
sum     78             93
min     12             17

In [53]:
df.agg({'marks': ['sum','min']})

     marks
sum     78
min     12

In [54]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df1 = pd.DataFrame({"A":[12, 4, 5, None, 1],
                "B":[7, 2, 54, 3, None],
                "C":[20, 16, 11, 3, 8],
                "D":[14, 3, None, 2, 6]})

# skip the Na values while finding the mean
df1.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

In [63]:
import pandas as pd

# Define a dictionary containing Students data
data = {'Name': ['Pandas', 'Geeks', 'for', 'Geeks'],
        'Height': [1, 2, 3, 4],
        'Qualification': ['A', 'B', 'C', 'D']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
df

     Name  Height Qualification
0  Pandas       1             A
1   Geeks       2             B
2     for       3             C
3   Geeks       4             D

In [64]:
## add field
address=['Newyork','Chicago','Boston','Miami']
df['Address']=address
df

     Name  Height Qualification  Address
0  Pandas       1             A  Newyork
1   Geeks       2             B  Chicago
2     for       3             C   Boston
3   Geeks       4             D    Miami

In [66]:
df.assign(points=[12,34,21,43])

     Name  Height Qualification  Address  points
0  Pandas       1             A  Newyork      12
1   Geeks       2             B  Chicago      34
2     for       3             C   Boston      21
3   Geeks       4             D    Miami      43

In [67]:
# Using insert() to add a column at position 2 (3rd column)
df.insert(2, "Age", [21, 23, 24, 21], True)
print(df)

     Name  Height  Age Qualification  Address
0  Pandas       1   21             A  Newyork
1   Geeks       2   23             B  Chicago
2     for       3   24             C   Boston
3   Geeks       4   21             D    Miami

In [71]:
##Add column that will give category if height is greater than equal 3 Tall other wise short
df.loc[df['Height']>=3,'category']='Tall'
df.loc[df['Height']<3,'category']='short'
df

     Name  Height  Age Qualification  Address category
0  Pandas       1   21             A  Newyork    short
1   Geeks       2   23             B  Chicago    short
2     for       3   24             C   Boston     Tall
3   Geeks       4   21             D    Miami     Tall

In [72]:

# Sort the DataFrame by the 'Name' column in ascending order
df.sort_values("Address", axis=0, ascending=True, inplace=True, na_position='last')

# Display the sorted DataFrame
print("\nSorted DataFrame:")
display(df.head())

Sorted DataFrame:

     Name  Height  Age Qualification  Address category
2     for       3   24             C   Boston     Tall
1   Geeks       2   23             B  Chicago    short
3   Geeks       4   21             D    Miami     Tall
0  Pandas       1   21             A  Newyork    short

In [81]:
df.loc[len(df)] = ['Sharad', 5, 25, 'M', 'Delhi', 'Tall']